# 📚 Реалізація системи відповідей у Slack

## 🧩 Задача

Необхідно реалізути функціонал для автоматизованої або напівавтоматизованої взаємодії з користувачами у Slack.
## Key Features
- Бот має отримувати інформацію із зовнішніх джерел
- Бот має формувати запити в канали
- Бот має формувати повідомлення в DM
- Бот має відправляти кастомні запити
- Бот має отримувати інформацію з внутрішнього каналу Slack

## 🧠 Мій підхід

- Провів детальний аналіз поставленої задачі
- Визначив ключові запити команди розробки
- Склав схему проєкту в Miro
- Створив і налаштував Slack App
- Створив і налаштував Slack Workflow
- Реалізував повноцінний n8n проєкт, котрий оптимізує роботу команди

## 🛠️ Інструменти

- Slack API
- Slack App
- Slack Workflow
- `n8n` — оплатформа для автоматизації
- `JavaScript` — перевірка запитів і побудова кастомної логіки, обробка токенів
- `Base64`, `timestamp`, робота з cookie/session storage, загальне розуміння інформації що передається

## ✅ Результат

- Отримано повний доступ до необхідних даних у рамках існуючого користувацького доступу
- Побудована інтеграція дозволила автоматично обробляти інформацію

------------------------------------------------------------------------------------------------------------------------------------------

> ⚠️ Проєкт є оглядовою версією, створеною задля демонстрації професійних навичок інтегратора 
